---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDesiredNumRisers
source: html/2e46b7b3-ec6f-6554-e698-2178a13d5ef5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDesiredNumRisers Property

"Desired Number of Risers"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDesiredNumRisers { get; }
```